# Задача 2. Экранирование спецсимволов
#
# В уроке при написании шаблона мы брали только обычные строки, без всяких специальных знаков.
# Часть из этих спецсимволов является неотъемлемой частью регулярных выражений
# (о чём мы поговорим уже в следующем уроке), они даже выделяются своими цветами при написании паттернов. Например:
#
# Поэтому если мы хотим найти в тексте спецсимвол, а не использовать его как часть паттерна,
# то нужно его дополнительно экранировать — добавить обратный слеш перед этим знаком.
# Например, если нам нужно будет найти шаблон wd+?. в виде полноценного текста, то это будет выглядеть так:
#
# А теперь сама задача. Дан немного изменённый текст скороговорки:
#
# How much \wwood+?, would a \wwood+?chuck \dwwood+, chuck if a \wwood+?,chuck could chuck \wwood?,
#
# Напишите программу, которая выводит список из всех упоминаний подстроки \wwood+?,
#
# Ожидаемый результат:
#
# Список всех упоминаний шаблона: ['\\wwood+?,', '\\wwood+?,']
import re

test = 'How much \wwood+?, would a \wwood+?chuck \dwwood+, chuck if a \wwood+?,chuck could chuck \wwood?'

result = re.findall(r"\\w\wood\+\?,", test)
print(result)