# Задача 2. Очень большой файл
#
# Вам на обработку пришёл огромнейший файл с данными. Настолько огромный, что при его открытии компьютер просто
# зависает,
# так как данные не помещаются в оперативной памяти вашего суперкомпьютера (не очень-то и «супер»).
#
# В файле numbers.txt есть N чисел, разделённых пробелами и литералом пропуска строки. Напишите программу,
# которая подсчитает общую сумму чисел в файле. Для считывания файла реализуйте специальный генератор.
#
# Оцените занятие

def my_func(file):
    for string in file:
        for num in string.split():
            yield int(num)


with open('numbers.txt', 'r') as file:
    my_num = my_func(file)
    print(sum(my_num))





